In [5]:
import pandas as pd

In [6]:
customers = pd.read_excel("H+ Sport Customers.xlsx")

In [25]:
customers.isnull().sum()

CustomerID    0
FirstName     0
LastName      0
Email         0
Phone         0
Address       0
City          0
State         0
Zipcode       0
dtype: int64

Customers

In [14]:
customers.head()

,CustomerID,FirstName,LastName,Email,Phone,Address,City,State,Zipcode
0,100,Carol,Shaw,cshaw0@mlb.com,(206)804-8771,8157 Longview Court,Seattle,WA,98121
1,101,Elizabeth,Carr,ecarr1@oracle.com,(512)187-2507,3934 Petterle Trail,Austin,TX,78732
2,102,Ernest,Ramos,eramos2@plala.or.jp,(816)540-4257,8699 Clarendon Terrace,Kansas City,MO,64199
3,103,Jane,Carter,jcarter3@harvard.edu,(214)839-0542,2830 Novick Lane,Irving,TX,75037
4,104,Martha,Cooper,mcooper4@go.com,(727)235-5696,4537 Hoard Lane,Tampa,FL,33625

In [7]:
columns_to_check = ['Email', 'Phone','FirstName', 'LastName']

In [8]:
duplicates = customers[customers.duplicated(columns_to_check)]

In [9]:
duplicates.head()

,CustomerID,FirstName,LastName,Email,Phone,Address,City,State,Zipcode
1000,1100,Chris,Moreno,cmorenond@mac.com,(907)709-6086,8740 Oak Valley Park,Fairbanks,AK,99790
1001,1101,Gerald,Green,ggreenne@wisc.edu,(203)541-4782,242 Eastlawn Drive,New Haven,CT,6510
1002,1102,Johnny,Ruiz,jruiznf@nba.com,(202)731-4171,70917 Meadow Valley Crossing,Washington,DC,20337
1003,1103,Carlos,Morales,cmoralesng@ed.gov,(517)792-4134,8 Jay Way,Lansing,MI,48956
1004,1104,Gloria,Ramos,gramosnh@xing.com,(646)144-6692,32091 Ryan Street,New York City,NY,10110

In [10]:
duplicates.shape

(29, 9)

duplicates removed customer data

In [11]:
customers = customers[customers.duplicated(columns_to_check, keep='first')]

Employees

In [3]:
employees = pd.read_excel("H+ Sport Employees.xlsx", sheet_name="Employees-Table")

In [4]:
employees.head()

,Employee Name,Building,Department,Status,Hire Date,Month,Years,Benefits,Salary,Job Rating,New Salary,Tax Rate,2.91%
0,"Page, Lisa",West,ADC,Full Time,1999-01-11,Jan,25,DMR,24550,1,NaN,NaN,NaN
1,"Taylor, Hector",West,ADC,Half-Time,2011-02-21,Feb,12,DM,26795,4,NaN,NaN,NaN
2,"Dawson, Jonathan",West,ADC,Contract,2007-03-06,Mar,16,NaN,42540,5,NaN,NaN,NaN
3,"Duran, Brian",Taft,ADC,Hourly,2012-08-30,Aug,11,NaN,35680,2,NaN,NaN,NaN
4,"Weber, Larry",Watson,ADC,Full Time,2007-12-31,Dec,16,M,72830,2,NaN,NaN,NaN

In [8]:
columns_to_check2 = employees.columns[:-4]

In [16]:
transformed_employees = employees[columns_to_check2]

In [17]:
transformed_employees.head()

,Employee Name,Building,Department,Status,Hire Date,Month,Years,Benefits,Salary
0,"Page, Lisa",West,ADC,Full Time,1999-01-11,Jan,25,DMR,24550
1,"Taylor, Hector",West,ADC,Half-Time,2011-02-21,Feb,12,DM,26795
2,"Dawson, Jonathan",West,ADC,Contract,2007-03-06,Mar,16,NaN,42540
3,"Duran, Brian",Taft,ADC,Hourly,2012-08-30,Aug,11,NaN,35680
4,"Weber, Larry",Watson,ADC,Full Time,2007-12-31,Dec,16,M,72830

In [2]:
import sqlalchemy as db

In [3]:
db.create_engine('postgresql://avnadmin:AVNS_aeWgoKHGIfnH8ZlkZPy@etl-shantheep49-7294.l.aivencloud.com:24875/defaultdb?sslmode=require')

Engine(postgresql://avnadmin:***@etl-shantheep49-7294.l.aivencloud.com:24875/defaultdb?sslmode=require)

In [ ]:
customers_to_sql = customers.to_sql('customers', con=db.engine, if_exists='replace', index=False)

C:\Users\gshan\AppData\Local\Temp\ipykernel_28112\2903802007.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  customers_to_sql = customers.to_sql('customers', con=db.engine, if_exists='replace', index=False)

TypeError: 'module' object is not callable